commands_templates/DeleteRecordingJob0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/recording/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:DeleteRecordingJob>
         <!--type: RecordingJobReference-->
         <wsdl:JobToken>?</wsdl:JobToken>
      </wsdl:DeleteRecordingJob>
   </soap:Body>
</soap:Envelope>